import random
import time


def lottery(candidate1, candidate2, candidate3):
    luckylist = []
    luckylist.append(candidate1)
    luckylist.append(candidate2)
    luckylist.append(candidate3)

    a = random.choice(luckylist)
    print('开奖倒计时', 3)
    time.sleep(1)
    print('开奖倒计时', 2)
    time.sleep(1)
    print('开奖倒计时', 1)
    time.sleep(1)
    image = '''
     /\_)o<
    |      \\
    | O . O|
     \_____/
   
   #####################################################
#                                                   #
#                       _oo0oo_                     #
#                      o8888888o                    #
#                      88" . "88                    #
#                      (| -_- |)                    #
#                      0\  =  /0                    #
#                    ___/`---'\___                  #
#                  .' \\|     |# '.                 #
#                 / \\|||  :  |||# \                #
#                / _||||| -:- |||||- \              #
#               |   | \\\  -  #/ |   |              #
#               | \_|  ''\---/''  |_/ |             #
#               \  .-\__  '-'  ___/-. /             #
#             ___'. .'  /--.--\  `. .'___           #
#          ."" '<  `.___\_<|>_/___.' >' "".         #
#         | | :  `- \`.;`\ _ /`;.`/ - ` : | |       #
#         \  \ `_.   \_ __\ /__ _/   .-` /  /       #
#     =====`-.____`.___ \_____/___.-`___.-'=====    #
#                       `=---='                     #
#     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   #
#                                                   #
#                                                   #
#                                                   #
#####################################################
    '''
    print(image)
    print('恭喜' + a + '中奖！')


lottery('张三', '李四', '王五')